{
  "posts": [
    {
      "id": "maya-001",
      "status": "draft",
      "topic": "Defying Mumbai's monsoon in avant-garde street style.",
      "caption": "They said stay home. I said, make an entrance. Some weather report.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-24T13:07:41Z",
      "notes": "Full shot, Maya in a structured, waterproof trench coat over a vibrant outfit, perhaps designer gumboots. Rain streaks visible but not obscuring her. Dark, moody overcast sky, street lights reflecting on wet asphalt. Confident, direct gaze, walking towards the camera. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-002",
      "status": "posted",
      "topic": "Effortless glam at a high-end Mumbai brunch spot.",
      "caption": "This ain't your usual Sunday spread. Neither am I. Know the difference.",
      "image_url": "generated_images/maya-002.png",
      "video_url": "generated_images/maya-002.mp4",
      "is_reel": true,
      "scheduled_at": "2026-02-25T13:00:00Z",
      "notes": "Mid-shot, Maya at a beautifully set outdoor cafe table, perhaps overlooking greenery or the sea. Wearing a sophisticated yet relaxed linen co-ord set in earthy tones, statement sunglasses slightly pushed down. Soft, natural sunlight, an exquisite coffee cup in frame. Relaxed but knowing smile, one hand gracefully supporting her chin. | generated_by=gemini:gemini-2.5-flash",
      "publish_error": null,
      "posted_at": "2026-02-25T16:20:28Z",
      "platform_post_id": "3840442103013086666"
    },
    {
      "id": "maya-003",
      "status": "approved",
      "topic": "Command the night in a dazzling evening ensemble on a Mumbai rooftop.",
      "caption": "Some stars shine. Others just show up and outshine. Choose your fighter.",
      "image_url": "",
      "video_url": "generated_images/maya-003.mp4",
      "is_reel": true,
      "scheduled_at": "2026-02-25T19:00:00Z",
      "notes": "Three-quarter shot, Maya on a luxurious Mumbai rooftop bar at dusk. Wearing a sequined or metallic bodycon dress, perhaps with an asymmetrical cut. City skyline lights sparkling in the background, a dramatic cocktail in hand. Warm ambient lighting, focused on her, strong contouring. A slight smirk, intense eye contact. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-004",
      "status": "draft",
      "topic": "Arriving at an exclusive art gallery opening in Bandra, Mumbai.",
      "caption": "They say 'arrive fashionably late'.\nI just arrive fashionably.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-23T18:00:00Z",
      "notes": "Full-length shot, Maya walking through a grand entrance in a structured, jewel-toned power suit. Slight blur of paparazzi flashes in the background. Low-angle to emphasize stature. Rich, ambient lighting with cool gallery lights and warm accents. Regal, powerful stride. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-005",
      "status": "approved",
      "topic": "Sipping chai at a trendy, sun-drenched cafe in Kala Ghoda, Mumbai.",
      "caption": "This chai hits different.\nMust be the company.",
      "image_url": "generated_images/maya-005.png",
      "video_url": "generated_images/maya-005.mp4",
      "is_reel": true,
      "scheduled_at": "2026-02-26T13:00:00Z",
      "notes": "Close-up shot, Maya holding a cutting chai glass with a gentle, knowing smile. Dressed in an oversized crisp white shirt and tailored linen trousers. Soft, natural sunlight streaming in, creating warm highlights. Focus on hands and face, with a hint of the cafe's minimalist decor in the background. Relaxed, elegant posture. | generated_by=gemini:gemini-2.5-flash",
      "publish_error": null
    },
    {
      "id": "maya-006",
      "status": "draft",
      "topic": "Post-shoot wind-down in a luxurious penthouse apartment, hair slightly undone but makeup still flawless.",
      "caption": "Made them look, then made my exit.\nThat's the formula, darling.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-24T04:46:25Z",
      "notes": "Medium close-up, Maya lounging artfully on a plush sofa in a loose, comfortable robe, revealing a statement necklace. Eyes slightly lidded, a hint of a smirk. Golden hour light streaming through large windows, creating dramatic shadows and highlights. Hair casually disheveled. Alluring, powerful, slightly tired but captivating mood. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-007",
      "status": "draft",
      "topic": "Mumbai rooftop soirée, commanding attention.",
      "caption": "They thought the skyline was the view.\nSweetie, I am the view.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-23T21:07:41Z",
      "notes": "Medium close-up, Maya in a sleek, sequined or silk gown, soft golden hour lighting fading into twilight, bokeh of city lights behind her, confident direct gaze. Mood: Glamorous, powerful. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-008",
      "status": "draft",
      "topic": "Effortless style at a quaint cafe.",
      "caption": "Some outfits require an explanation.\nMine just requires appreciation.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-24T01:07:41Z",
      "notes": "Eye-level shot across a marble-top cafe table, Maya in a well-tailored but relaxed linen co-ord set, sipping a coffee, soft daylight through a large window, warm and inviting tones. Mood: Chic, relaxed, self-assured. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-009",
      "status": "draft",
      "topic": "Making a statement on the vibrant streets of Colaba.",
      "caption": "I don't fit in.\nI make the space fit me.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-24T05:07:41Z",
      "notes": "Full body shot, Maya in an oversized blazer and statement accessories, walking confidently down a busy Colaba street with vibrant, slightly faded architectural details or street art, strong directional sunlight creating sharp shadows, dynamic pose, looking slightly off-camera with a smirk. Mood: Edgy, commanding, urban chic. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-010",
      "status": "posted",
      "topic": "Casual morning coffee at a Mumbai cafe, wearing a white kurta and gold jhumkas.",
      "caption": "Morning people are overrated.\nI just have better coffee.",
      "image_url": "generated_images/maya-010.png",
      "video_url": "generated_images/maya-010.mp4",
      "is_reel": true,
      "scheduled_at": "2026-02-23T18:00:00Z",
      "notes": "Warm cafe interior, white kurta, gold jhumkas, natural morning light, holding coffee cup. | generated_by=replicate:flux-kontext-pro",
      "publish_error": null,
      "posted_at": "2026-02-24T17:37:14Z",
      "platform_post_id": "unknown"
    },
    {
      "id": "maya-011",
      "status": "draft",
      "topic": "Making an entrance at a high-fashion Mumbai gala.",
      "caption": "They said 'arrive when ready.' My ready took a while. Worth it.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-23T22:41:31Z",
      "notes": "Full-length shot from a slight low angle. Maya in a striking, avant-garde gown, just stepping out of a luxury car or at the entrance of a grand venue. Dramatic, soft spotlighting, blurred background of paparazzi flashes. Mood: Regal, show-stopping. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-012",
      "status": "draft",
      "topic": "A stylish afternoon at a heritage cafe in South Mumbai.",
      "caption": "You assume this is effortless. I'm just living my truth.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-24T02:41:31Z",
      "notes": "Medium close-up. Maya holding a vintage teacup at a sunlit cafe table. Soft, natural light filtering through a window, highlighting intricate details of a stylish, relaxed-fit ensemble (e.g., linen co-ord set, delicate jewelry). Background: softly blurred ornate cafe interior. Mood: Serene, sophisticated, candid. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-013",
      "status": "draft",
      "topic": "Owning the night at a luxury Mumbai rooftop bar.",
      "caption": "The city lights are pretty. I think I know why they’re looking this way.",
      "image_url": "",
      "video_url": null,
      "is_reel": true,
      "scheduled_at": "2026-02-24T06:41:31Z",
      "notes": "Three-quarter shot. Maya silhouetted slightly against a vibrant Mumbai skyline at twilight, a luxury rooftop bar setting. Dressed in a sleek, shimmering cocktail dress. Soft, warm ambient lighting with strategic backlighting from the city. Hair styled dramatically. Mood: Glamorous, powerful, alluring. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-014",
      "status": "draft",
      "topic": "A glamorous Mumbai fashion event",
      "caption": "They dressed to impress. I just showed up.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-23T22:52:00Z",
      "notes": "Full body shot of Maya in a sleek, shimmering cocktail dress at a dimly lit, high-end event space. She's mid-stride, confident gaze over her shoulder. Soft, dramatic spotlights highlight her. Background bokeh of blurred luxury decor and people. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-015",
      "status": "draft",
      "topic": "Brunch at a chic Mumbai cafe",
      "caption": "This is my 'I barely tried' look. What's your excuse?",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-24T02:52:00Z",
      "notes": "Maya seated casually at an outdoor cafe table, sipping coffee. She's wearing an oversized pastel blazer, cropped top, high-waisted trousers, and designer sunglasses. Bright natural light, warm tones. Focus on her relaxed but impeccably styled posture. A subtle smirk. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-016",
      "status": "draft",
      "topic": "An opulent heritage building photoshoot",
      "caption": "Some spaces just know how to appreciate a masterpiece.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-24T06:52:00Z",
      "notes": "Maya standing confidently in a grand, empty hallway of an old colonial-era Mumbai building with intricate architectural details. She's wearing a structured, avant-garde Indian fusion outfit (e.g., modern saree gown or tailored kurta-set with bold jewelry). Strong, directional light casting interesting shadows. A slight low-angle shot to emphasize height and power. Her expression is calm but intense. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-017",
      "status": "draft",
      "topic": "Power suit strut on a busy Mumbai street.",
      "caption": "Mumbai moves with my rhythm. You just watch.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-25T20:14:32Z",
      "notes": "Full-body shot. Maya in a sharp, tailored power suit (e.g., emerald green, deep navy). Walking purposefully on a busy street (Colaba or Fort area, subtle vintage architecture in background). Golden hour sunlight hitting her face and suit, casting long shadows. Slightly low angle to emphasize height and power. Confident, direct gaze. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-018",
      "status": "draft",
      "topic": "Lounging elegantly in a luxurious apartment with a city skyline view.",
      "caption": "It’s called effortless. Maybe you’ve heard of it.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-26T00:14:32Z",
      "notes": "Mid-shot. Maya in a luxurious yet relaxed silk coord set or a chic loungewear dress. Reclining elegantly on a plush sofa or by a large window overlooking the Mumbai skyline (sea view if possible). Soft, natural light filtering in. Calm, serene, slightly playful expression. Elegant, understated jewelry. | generated_by=gemini:gemini-2.5-flash"
    },
    {
      "id": "maya-019",
      "status": "draft",
      "topic": "Making an unforgettable entrance at an exclusive club or event.",
      "caption": "My presence is the only invitation needed.",
      "image_url": "",
      "video_url": null,
      "is_reel": false,
      "scheduled_at": "2026-02-26T04:14:32Z",
      "notes": "Dynamic shot. Maya pausing dramatically at the entrance of a high-end club or bar. Dressed in a striking evening gown or a chic, edgy party outfit (e.g., sequined mini dress, sharp cut-out details). Low, ambient lighting with neon accents or a spotlight on her. Her back is slightly turned, looking over her shoulder with a captivating, almost mischievous smirk. Focus on the silhouette and sparkle. | generated_by=gemini:gemini-2.5-flash"
    }
  ]
}
